const landData = {
  "tianzihun": [
    {
      "name": "长合区2025-9、10、11地块",
      "location": "天子湖北园区—杭轴北侧",
      "type": "转而未供",
      "area": 130.6,
      "note": ""
    },
    {
      "name": "倍豪纺织收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 95.8,
      "note": ""
    },
    {
      "name": "浙江天昊建设发展有限公司",
      "location": "高禹中学东侧",
      "type": "供而未用",
      "area": 92.9,
      "note": "商业用地"
    },
    {
      "name": "骏盛胶粘收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 86.0,
      "note": "租赁铭天电子"
    },
    {
      "name": "环球合金收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 61.8,
      "note": ""
    },
    {
      "name": "长合区2025-12、13地块",
      "location": "天子湖北园区—原青钠西南侧",
      "type": "转而未供",
      "area": 53.7,
      "note": ""
    },
    {
      "name": "禾华收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 48.1,
      "note": ""
    },
    {
      "name": "中建国际投资（杭州）有限公司",
      "location": "高铁站东侧",
      "type": "供而未用",
      "area": 46.8,
      "note": "商业用地"
    },
    {
      "name": "浙江华丰龙赛尔纤维科技有限公司",
      "location": "天子湖南园区",
      "type": "供而未用",
      "area": 44.8,
      "note": ""
    },
    {
      "name": "泰嘉实业收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 41.7,
      "note": ""
    },
    {
      "name": "欧科收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 37.8,
      "note": ""
    },
    {
      "name": "浙江安吉建设控股集团有限公司",
      "location": "高禹中学东侧",
      "type": "供而未用",
      "area": 33.7,
      "note": "商业用地"
    },
    {
      "name": "浙江长天建设发展有限公司",
      "location": "天子湖南园区",
      "type": "供而未用",
      "area": 32.2,
      "note": ""
    }
  ],
  "sian": [
    {
      "name": "泗安镇（长合区）17号、18号地块",
      "location": "235国道西平台—鑫丰产业园西侧",
      "type": "转而未供",
      "area": 175.4,
      "note": "需处置矿产资源"
    },
    {
      "name": "兴发新材（浙江）有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 88.5,
      "note": ""
    },
    {
      "name": "浙江创世纪机械有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 87.6,
      "note": ""
    },
    {
      "name": "长三角一体化(三）-12号-5地块",
      "location": "泗安南华山平台—杭摩欧亿北侧",
      "type": "转而未供",
      "area": 75.9,
      "note": ""
    },
    {
      "name": "蒲公英收储地块",
      "location": "泗安南华山平台",
      "type": "收储土地",
      "area": 68.4,
      "note": ""
    },
    {
      "name": "锋盛收储地块",
      "location": "泗安绿洲大道",
      "type": "收储土地",
      "area": 58.4,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）21号-4地块",
      "location": "235国道西平台—鑫丰产业园西侧",
      "type": "转而未供",
      "area": 57.5,
      "note": "需考古"
    },
    {
      "name": "上阀（浙江）流体科技有限公司（二期）",
      "location": "235国道西平台",
      "type": "供而未用",
      "area": 54.3,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）20号-3地块",
      "location": "235国道西平台-久茂二期西侧",
      "type": "转而未供",
      "area": 52.3,
      "note": ""
    },
    {
      "name": "浙江长泗建设开发有限公司",
      "location": "泗安镇莲花村",
      "type": "供而未用",
      "area": 48.7,
      "note": "商业用地"
    },
    {
      "name": "长兴富长实业有限公司",
      "location": "泗安镇莲花村",
      "type": "供而未用",
      "area": 37.7,
      "note": "商业用地"
    },
    {
      "name": "泗安镇（长合区）9号-4地块",
      "location": "235国道西平台—东升西侧",
      "type": "转而未供",
      "area": 31.0,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）13号-1地块",
      "location": "235国道西平台—东创西侧",
      "type": "转而未供",
      "area": 30.0,
      "note": ""
    },
    {
      "name": "长泗收储地块",
      "location": "泗安南华山平台-锦瑞南侧",
      "type": "收储土地",
      "area": 16.3,
      "note": ""
    },
    {
      "name": "浙江方向电子有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 15.0,
      "note": ""
    },
    {
      "name": "雅柏特滤材科技（浙江）有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 13.9,
      "note": ""
    }
  ],
  "total": [
    {
      "name": "泗安镇（长合区）17号、18号地块",
      "location": "235国道西平台—鑫丰产业园西侧",
      "type": "转而未供",
      "area": 175.4,
      "note": "需处置矿产资源"
    },
    {
      "name": "长合区2025-9、10、11地块",
      "location": "天子湖北园区—杭轴北侧",
      "type": "转而未供",
      "area": 130.6,
      "note": ""
    },
    {
      "name": "倍豪纺织收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 95.8,
      "note": ""
    },
    {
      "name": "浙江天昊建设发展有限公司",
      "location": "高禹中学东侧",
      "type": "供而未用",
      "area": 92.9,
      "note": "商业用地"
    },
    {
      "name": "兴发新材（浙江）有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 88.5,
      "note": ""
    },
    {
      "name": "浙江创世纪机械有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 87.6,
      "note": ""
    },
    {
      "name": "骏盛胶粘收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 86.0,
      "note": "租赁铭天电子"
    },
    {
      "name": "长三角一体化(三）-12号-5地块",
      "location": "泗安南华山平台—杭摩欧亿北侧",
      "type": "转而未供",
      "area": 75.9,
      "note": ""
    },
    {
      "name": "蒲公英收储地块",
      "location": "泗安南华山平台",
      "type": "收储土地",
      "area": 68.4,
      "note": ""
    },
    {
      "name": "环球合金收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 61.8,
      "note": ""
    },
    {
      "name": "锋盛收储地块",
      "location": "泗安绿洲大道",
      "type": "收储土地",
      "area": 58.4,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）21号-4地块",
      "location": "235国道西平台—鑫丰产业园西侧",
      "type": "转而未供",
      "area": 57.5,
      "note": "需考古"
    },
    {
      "name": "上阀（浙江）流体科技有限公司（二期）",
      "location": "235国道西平台",
      "type": "供而未用",
      "area": 54.3,
      "note": ""
    },
    {
      "name": "长合区2025-12、13地块",
      "location": "天子湖北园区—原青钠西南侧",
      "type": "转而未供",
      "area": 53.7,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）20号-3地块",
      "location": "235国道西平台-久茂二期西侧",
      "type": "转而未供",
      "area": 52.3,
      "note": ""
    },
    {
      "name": "浙江长泗建设开发有限公司",
      "location": "泗安镇莲花村",
      "type": "供而未用",
      "area": 48.7,
      "note": "商业用地"
    },
    {
      "name": "禾华收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 48.1,
      "note": ""
    },
    {
      "name": "中建国际投资（杭州）有限公司",
      "location": "高铁站东侧",
      "type": "供而未用",
      "area": 46.8,
      "note": "商业用地"
    },
    {
      "name": "浙江华丰龙赛尔纤维科技有限公司",
      "location": "天子湖南园区",
      "type": "供而未用",
      "area": 44.8,
      "note": ""
    },
    {
      "name": "泰嘉实业收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 41.7,
      "note": ""
    },
    {
      "name": "欧科收储地块",
      "location": "天子湖南园区",
      "type": "收储土地",
      "area": 37.8,
      "note": ""
    },
    {
      "name": "长兴富长实业有限公司",
      "location": "泗安镇莲花村",
      "type": "供而未用",
      "area": 37.7,
      "note": "商业用地"
    },
    {
      "name": "浙江安吉建设控股集团有限公司",
      "location": "高禹中学东侧",
      "type": "供而未用",
      "area": 33.7,
      "note": "商业用地"
    },
    {
      "name": "浙江长天建设发展有限公司",
      "location": "天子湖南园区",
      "type": "供而未用",
      "area": 32.2,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）9号-4地块",
      "location": "235国道西平台—东升西侧",
      "type": "转而未供",
      "area": 31.0,
      "note": ""
    },
    {
      "name": "泗安镇（长合区）13号-1地块",
      "location": "235国道西平台—东创西侧",
      "type": "转而未供",
      "area": 30.0,
      "note": ""
    },
    {
      "name": "长泗收储地块",
      "location": "泗安南华山平台-锦瑞南侧",
      "type": "收储土地",
      "area": 16.3,
      "note": ""
    },
    {
      "name": "浙江方向电子有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 15.0,
      "note": ""
    },
    {
      "name": "雅柏特滤材科技（浙江）有限公司",
      "location": "泗安南华山平台",
      "type": "供而未用",
      "area": 13.9,
      "note": ""
    }
  ]
};